notes/A3--External-resources.tex
% Created 2020-09-02 Wed 17:23
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{tabularx}
\usepackage{etoolbox}
\makeatletter
\def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}}
\AtBeginEnvironment{minted}{\dontdofcolorbox}
\makeatother
\usepackage[newfloat]{minted}
\author{Mark Armstrong}
\date{\today}
\title{External resources}
\hypersetup{
   pdfauthor={Mark Armstrong},
   pdftitle={External resources},
   pdfkeywords={},
   pdfsubject={Information on, and where possible links to, various external resources for this course.},
   pdfcreator={Emacs 27.0.90 (Org mode 9.3.7)},
   pdflang={English},
   colorlinks,
   linkcolor=blue,
   citecolor=blue,
   urlcolor=blue
   }
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec:org7041854}
This course has no required textbooks or external resources.

However, herein are contained a number of \emph{recommended} resources,
along with information about what those resouces may be useful for.

Elsewhere in the course, we may refer to external resources using acronyms,
or using authors names. Both are documented here.

The collection is roughly organised by the principal topic of the resource.

\section{“Principles of Programming Languages” texts}
\label{sec:org95eeb8e}
\subsection{Structure and Interpretation of Computer Programs\hfill{}\textsc{SICP}}
\label{sec:org5bb1aac}
\subsection{Concepts, Techniques, and Models of Computer Programming\hfill{}\textsc{CTMCP}}
\label{sec:org2da1cc1}
\subsection{Principals of Programming Languages\hfill{}\textsc{Dowek}}
\label{sec:orgec3725c}

\section{Texts on specific programming languages}
\label{sec:orgbf9fe26}
\subsection{Programming Language Foundations in Agda\hfill{}\textsc{PLFA}}
\label{sec:org66e6995}
\subsection{The “little” series}
\label{sec:orgdf74737}
\end{document}
